{
    "Выберите свойства, которыми обладают автоматизированные системы:": "Эффективность\nСовместимость\nАдаптивность\nНадежность\nЖивучесть\nПомехоустойчивость",
    "В основу системы классификации автоматизированных систем положены следующие характеристики объектов и субъектов защиты, а также способов их взаимодействия:": "Информационные, определяющие ценность информации, ее объем и степень конфиденциальности, а также возможные последствия неправильного функционирования автоматизированной системы из-за искажения (потери) информации",
    "ИС как АС – это совокупность следующих составных частей:": "взаимосвязанная совокупность средств, методов и персонала, используемых для хранения, обработки и выдачи информации в интересах достижения поставленной цели (возможно)",
    "Какого вида информационных систем не существует?": "Существуют: структурированная система, неструктурированная система, экспертная система\nСуществует три вида информационных систем:\nБаза данных - система для хранения больших объёмов структурированной информации (информации, которая вводится по шаблону) определённого типа. К базам данных относятся следующие информационные системы:\n\tкаталог библиотеки;\n\tрегистратура больницы;\n\tзаписная книжка мобильного телефона;\n\tбаза данных отдела кадров.\nБаза знаний - система для хранения большого объема неструктурированной информации различных типов. К базам знаний относятся следующие информационные системы:\n\tбиблиотека;\n\tсеть Интернет.\nИнформационно-аналитическая система - система, предназначенная как для хранения, так и для анализа хранимой информации\n\tExсel;\n\tSTATISTICA;\n\tSPSS;\n\t1С бухгалтерия;\n\t1C предприятие.",
    "База данных - это:": "совокупность данных, организованных по определенным правилам",
    "Совокупность определенным образом организованной информации на какую либо тему – это": "База Даных",
    "Совокупность базы данных и всего комплекса программно-аппаратных, методологических и др. средств для работы с базой данных – это": "информационная система",
    "Что не входит в концепцию баз данных?": "данные ИС\tфизическая структура файлов фиксируется, а логическая структура данных представляется на её основе (разделение и физической и логической структуры)\tобработка запроса к данным через специальный интерфейс\tпрограммы разрабатываются на основе единой точки зрения",
    "Наиболее распространенными в практике являются:": "реляционные базы данных.",
    "Системы управления базами данных - это": "совокупность программных и лингвистических средств общего или специального назначения, обеспечивающих управление созданием и использованием баз данных.",
    "Что не входит в функции СУБД?": "проверка корректности прикладных программ, работающих с базой данных",
    "Как соотносятся понятия база данных и банк данных?": "банк данных включает базу данных",
    "Главная функция СУБД — это": "управление информацией",
    "Что такое предметная область?": "*часть реального мира для которой создается база данных\nПод предметной областью принято понимать некоторую область человеческой деятельности или область реального мира, подлежащих изучению для организации управления и автоматизации, например, предприятие, вуз и.т.д.",
    "Иерархическая модель соответствует следующим свойствам": "Свойства модели:\n\tкаждый элемент таблицы – один элемент данных\n\tвсе поля в таблице являются однородными, т.е. имеют один тип (числа, текст, дата и т.д.)\n\tкаждое поле имеет уникальное имя\n\tодинаковые строки в таблице отсутствуют\n\tпорядок следования строк произвольный",
    "Сущность – это": "объединение однотипных объектов, обладающих одинаковым набором ключевых характеристик",
    "Атрибут – это": "свойства характеризующие сущность, название столбца в таблице",
    "Ключ – это": "некие сущности, созданы для установления определенных ограничений, которые поддерживают целостность и доступность данных в таблицах баз данных",
    "Связь – это": "взаимосвязь между сущностями в предметной области",
    "Выберите правильный вариант проектирования БД": "Администратор БД",
    "На каком из этапов проектирования реляционной БД определяется состав и структура данных предметной области, функциональные связи между ними?": "Концептуальное проектирование",
    "Для чего предназначены запросы:": "для отбора и обработки данных базы;",
    "Единое вместительное хранилище разнообразных данных и описаний их структур, которое после своего определения, осуществляемого отдельно и независимо от приложений, используется одновременно многими приложениями - это": "база данных",
    "Какой язык, из поддерживаемых СУБД, используется для занесения данных, изменения или выборки данных?": "DML (Data Manipulation Language, язык манипуляции данными)",
    "Какое описание данных используется прикладными программами при работе с базой данных?": "описание логической модели данных",
    "Что не относится к этапам проектирования базы данных:": "разработка прикладных программ",
    "Что не относится к процессу проектирования концептуальной модели?": "Обычно концептуальная модель базы данных включает в себя:\n1)описание информационных обхектов. или понятий предметной области и связей между ними\n2)описание ограничений целостности, т.е. требований к допустимым значениям данных и к связям между ними.",
    "Выберите правильный вариант проектирования БД": "Анализ предметной области, с учетом требования конечных пользователей\nобобщенное описание БД с использованием естественного языка, математических формул, графиков и других средств\nформализация представления данных в БД\nрешение проблемы передачи данных",
    "На каком из этапов проектирования БД определяется состав и структура данных предметной области, функциональные связи между ними?": "Конечный результат этапа концептуального проектирования - информационно-логическая модель данных предметной области (концептуальная модель).",
    "На каком из этапов проектирования реляционной БД осуществляется разработка структуры таблиц, определение их ключей, связей между ними?": "Логическое проектирование",
    "На каком из этапов проектирования реляционной БД решаются вопросы хранения БД?": "На этапе физического проектирования",
    "Что такое концептуальная модель?": "обобщенное представление пользователей о данных",
    "Что входит в представление концептуальной модели?": "информационное описание предметной области\nлогические взаимосвязи между данными",
    "Как соотносятся понятия логической модели и концептуальной модели?": "логическая модель это вариант представления концептуальной модели",
    "Какая связь между логической моделью базы данных и СУБД?": "логическая модель базы данных использует спецификации СУБД\nСУБД отображает логическую модель базы данных в структуру хранения",
    "Какие действия выполняются на этапе физического проектирования?": "Проектирование таблиц базы данных средством выбранной СУБД\nРеализация бизнес-правил в среде выбранной СУБД\nПроектирование физической организации базы данных\nРазработка стратегий защиты базы данных\nОрганизация мониторинга функционирования базы данных и ее настройка",
    "Последовательность уровней абстракции по мере возрастания их зависимости от физического формата хранения": "физический, даталогический(логический), информационно-логический",
    "Наиболее распространенными в практике являются:": "реляционные базы данных.",
    "Как называется основное понятие, с помощью которого описывается то, о чем будет накапливаться информация в информационной системе?": "сущность",
    "Если каждому объекту данных присваивается классификационный уровень, а каждый пользователь обладает уровнем допуска, то подход к обеспечению безопасности данных называется:": "обязательным",
    "Защита от несанкционированного доступа к информации называется:": "конфеденциальностью",
    "Защита от несанкционированного изменения информации называется:": "Целостностью",
    "Защита от несанкционированного разрушения информации называется:": "Доступностью",
    "Нормативно правовое обеспечение создания автоматизированных информационных систем (баз данных) не составляют:": "В состав правового обеспечения входят\nзаконы\nуказы\nпостановления государственных органов власти\nприказы\nинструкции и другие нормативные документы министерств, ведомств, местных органов власти",
    "Какой язык, из поддерживаемых СУБД, используется для занесения данных, изменения или выборки данных?": "Язык манипулирования данными",
    "Логически в современной реляционной СУБД можно выделить: ядро СУБД, компилятор языка БД, подсистему поддержки времени выполнения, контроллер доступа к данным, набор утилит. Какой компонент в этом определении лишний?": "контроллер доступа к данным",
    "Оператор CREATE TABLE служит для:": "Создании таблиц",
    "Последовательность скомпилированных операторов SQL, хранящихся в системной базе СУБД - это:": "хранимая процедура",
    "Процесс организации данных путем ликвидации повторяющихся групп и иных противоречий с целью приведения таблиц к виду, позволяющему осуществлять непротиворечивое и корректное редактирование данных:": "Нормализация данных",
    "Связи, когда одна и та же запись может входить в отношения со многими другими записями называют:": "один ко многим",
    "Связи, когда одна и та же запись может входить в отношения только с одной записью называют:": "один к одному",
    "Таблица СУБД содержит": "Информацию о совокупности однотипных объектов",
    "Какие служебные слова могут использоваться в операторе DELETE?": "FROM\nWHERE",
    "C каким из перечисленных ниже человеком связывают разработки в области реляционных баз данных?": "Эдгар Франк “Тед”Кодд в 1970г",
    "Реляционная модель соответствует следующим свойствам": "– Отсутствие кортежей-дубликатов (в отношении нет одинаковых кортежей)\n– Отсутствие требований к упорядоченности кортежей (кортежи не упорядочены (сверху вниз))\n– Отсутствие упорядоченности атрибутов (слева направо)\n– Атомарность значений атрибутов",
    "Наиболее точным аналогом реляционной базы данных может служить:": "двумерная таблица",
    "Отношения (таблицы) в базах данных предназначены:": "для хранения данных базы",
    "Отношение (таблица данных) содержит": "Отношение содержит данные о сущностях определённого типа.",
    "Кортеж отношения (таблицы данных) содержит": "Строка таблицы",
    "Структура отношения определяется (это как с богом, она вроде есть, но на самом деле ее нет!! rest in pepe)": "Кратко: структура - обычная двумерная таблица, где столбцы - атрибуты, строки -кортежи\n(Отношение обычно имеет простую графическую интерпретацию в виде таблицы, столбцы которой соответствуют атрибутам, а строки — кортежам, а в «ячейках» находятся значения атрибутов в кортежах. )",
    "Укажите правильное определение для термина «домен»": "Множество логически неделимых допустимых значений для того или иного атрибута\nСемантическое понятие, подмножеств значений некоторого типа данных, имеющих определенный смысл",
    "Что называется отношением?": "множество кортежей таблицы",
    "Что из перечисленного соответствует термину ОТНОШЕНИЕ?": "Таблица",
    "Что из перечисленного соответствует термину СТЕПЕНЬ (АРНОСТЬ) ОТНОШЕНИЯ?": "количетсво атрибутов таблицы",
    "Что из перечисленного соответствует термину АТРИБУТ?": "Наименование столбца таблицы",
    "Что из перечисленного соответствует термину КОРТЕЖ?": "строка таблицы",
    "Отношение называется главным (родительским), если": "Пусть дано отношение R . Подмножество атрибутов А отношения R будем называть внешним ключом , если:\n\tСуществует отношение S ( R и S не обязательно различны) с потенциальным ключом K\n\tКаждое значение A в отношении R всегда совпадает со значением K для некоторого кортежа из S , либо является null-значением.\nОтношение S называется родительским отношением, отношение R называется дочерним отношением.",
    "Отношение называется подчиненным, если": "Пусть дано отношение R . Подмножество атрибутов А отношения R будем называть внешним ключом , если:\n\tСуществует отношение S ( R и S не обязательно различны) с потенциальным ключом K\n\tКаждое значение A в отношении R всегда совпадает со значением K для некоторого кортежа из S , либо является null-значением.\nОтношение S называется родительским отношением, отношение R называется дочерним отношением.",
    "Какие аномалии необходимо устранить при проектировании реляционной базы данных?": "удаления\nобновления\nвключения",
    "Изменяется ли смысл отношения от перестановки его атрибутов и кортежей?": "Нет",
    "Какие термины используются на практике вместо термина «отношение»?": "таблица",
    "Какие термины используются на практике вместо термина «кортеж»?": "строка",
    "Какие типы связей между отношениями не поддерживаются в реляционной модели?": "один к одному\nодин ко многим\nмногие к одному",
    "Что означает понятие «ссылочная целостность»?": "Система и набор специальных правил, обеспечивающих единство связанных данных в базе данных называется ссылочной целостностью",
    "Что означает понятие “языковая целостность”?": "Структурная целостность означает, что СУБД должна допускать работу только с структурами данных типа «реляционное отношение»\nСтруктурная целостность подразумевает под собой то, что реляционная СУБД должна допускать работу только с однородными структурами данных ER-модели. При этом понятие «реляционного отношения» должно удовлетворять всем ограничениям, накладываемым на него в классической теории реляционной БД (отсутствие дубликатов записей, обязательное наличие первичного ключа).",
    "Укажите правильное утверждение для термина “первичный ключ”": "столбец или некоторое подмножество атрибутов, которое уникально, те единственным способом определяет строки\n\tбыть в таблице назначен только один\n\tбыть простым и составным\n\tоднозначно определять каждую запись в таблице",
    "Укажите правильное утверждение для термина “потенциальный ключ”": "подмножество атрибутов отношения, удовлетворяющее уникальности и неизбыточночти\nпростой или составной ключ, который уникально идентифицирует каждую запись",
    "Как удалить из таблицы data все записи, поле info_id которых не заполнено?": "DELETE  From data Where info_id IS NULL",
    "Какая из представленных команд служит для изменения структуры существующей таблицы?": "ALTER TABLE",
    "Запрос для выборки первых 14 записей из таблицы \"Users\" имеет вид:": "SELECT * FROM Users LIMIT 14",
    "Напишите запрос, возвращающий значения из колонки \"FirstName\" таблицы \"Users\"": "SELECT FirstName FROM Users",
    "Какое из представленных ключевых слов используется в разделе SELECT оператора SELECT?": "Все ключевые слова Select\nDISTINCT, ALL,*, schema, table.*  view.*, Expr, table view, subquery, WHERE, GROUP BY, HAVING, UNION UNION ALL INTERSECT, MINUS, ORDER BY, Expr, ASC DESC, FOR UPDATE, OF, NOWAIT",
    "Биометрическая идентификация и аутентификация пользователя это:": "идентификация потенциального пользователя путем измерения физиологических параметров и характеристик человека, особенностей его поведения",
    "Внешними дестабилизирующими факторами, создающими угрозы безопасности функционированию систем баз данных и СУБД, являются:": "а) сбои и отказы в аппаратуре вычислительных средств;\nб) вирусы и иные деструктивные программные элементы, распространяемые с использованием систем телекоммуникаций, обеспечивающих связь с внешней средой или внутренние коммуникации распределенной системы баз данных;\nв) изменения состава и конфигурации комплекса взаимодействующей аппаратуры системы за пределы, проверенные при тестировании или сертификации системы.",
    "Внутренними источниками угроз безопасности баз данных и СУБД являются:": "а) ошибки проектирования при разработке и реализации алгоритмов обеспечения безопасности аппаратуры, программных средств и баз данных;\nб) ошибки и несанкционированные действия пользователей, административного и обслуживающего персонала в процессе эксплуатации системы;\nв) недостаточная эффективность используемых методов и средств обеспечения информационной безопасности в штатных или особых условиях эксплуатации системы.",
    "Возможность возникновения на каком-либо этапе жизненного цикла компьютерной системы такого eё состояния, при котором создаются условия для реализации угроз безопасности информации - это:": "уязвимость",
    "Действия, предпринимаемые злоумышленником, которые заключаются в поиске и использовании уязвимостей информации - это:": "атака",
    "Классификация по локализации источника угрозы представляется следующим образом:": "а) угрозы, непосредственным источником которых является человек;\nб) угрозы, непосредственным источником которых являются штатные программно-аппаратные средства информационной системы;\nв) угрозы, непосредственным источником которых являются несанкционированно используемые программно-аппаратные средства;\nг) угрозы, непосредственным источником которых является среда обитания;",
    "Классификация по природе возникновения угрозы:": "а) естественные угрозы — угрозы, вызванные воздействием на систему баз данных и ее компоненты объективных физических процессов или стихийно развивающихся природных явлений.\nб) искусственные угрозы — угрозы информационной безопасности систем баз данных, связанных с деятельностью человека.",
    "Классификация по расположению источника угроз.": "а) угрозы, источник которых расположен вне контролируемой зоны места расположения автоматизированной информационной системы;\nб) угрозы, источник которых расположен в пределах контролируемой зоны расположения автоматизированной информационной системы, исключая места расположения клиентских терминалов и серверных помещений;\nв) угрозы, источник которых имеет доступ к терминальным устройствам автоматизированной информационной системы.\nг) угрозы, источник которых имеет доступ к помещениям, где расположены серверы автоматизированной информационной системы;",
    "Классификация по цели реализации угрозы:": "а) нарушение конфиденциальности информации, т. е. использование информации, хранящейся в системе, лицами или процессами, которые не были определены владельцами информации.\nб) нарушение целостности информации, т. е. модификация или уничтожение информации для ее обесценивания путем утраты соответствия с состоянием моделируемых сущностей реального мира.\nв) полное или частичное нарушение работоспособности системы за счет вывода из строя или некорректного изменения режимов работы компонентов системы, включая их модификацию или подмену;",
    "Под угрозой безопасности информации в компьютерной системе (КС) понимают:": "Событие или действие, которое может вызвать изменение функционирования КС, связанное с нарушением защищенности, обрабатываемой в ней информации.",
    "Потенциально возможное событие, действие, процесс или явление, которое может привести к изменению функционирования компьютерной системы:": "угроза",
    "Существуют три причины использования распределенных атак злоумышленником. Какая из перечисленных лишняя:": "отсутствие последствий после вторжения",
    "Уязвимость информации - это:": "возможность возникновения на каком-либо этапе жизненного цикла КС такого ее состояния, при котором создаются условия для реализации угроз безопасности информации."
}