{"1.\tКомплексная защита информации это:": "*целенаправленное регулярное применение в автоматизированных системах средств и методов, а также осуществление мероприятий с целью поддержания заданного уровня защищенности информации по всей совокупности показателей и условий, являющихся существенно значимыми, с точки зрения обеспечения безопасности информации;", "2.\tСтратегия защиты информации это:": "*продуманная процедура, направленная на предотвращение утечки информации, разрешение доступа к информации только проверенным лицам, ограждение информации от несанкционированного и непреднамеренного воздействия;", "3.\tУгроза информационной безопасности это:": "*потенциально возможное событие, действие, процесс или явление, которое может привести к нарушения информационной безопасности;", "4.\tК внутренним угрозам ИБ относят:": "*ошибки пользователей и сисадминов, ошибки в работе ПО, сбои в работе компьютерного оборудования, нарушение сотрудниками компании регламентов по работе с информацией;", "5.\tБезуликовые внутренние угрозы подразделяются на:": "*настраиваемые.", "6.\tК внешним угрозам ИБ относят:": "*несанкционированный доступ к информации со стороны заинтересованных организаций и отдельных лиц, компьютерные вирусы и иные вредоносные программы, стихийные бедствия и техногенные катастрофы;", "7.\tРеализация внешних угроз ИБ ИТКС связана с:": "*действиями российских операторов связи.", "8.\tУгрозы конфиденциальности:": "*заключается в том, что информация становится известной тому, кто не располагает полномочиями доступа к ней;", "9.\tУгрозы целостности:": "*угрозы, связанные с вероятностью модификации той или иной информации, хранящейся в информационной системе", "10.\tУгрозы доступности:": "*создание таких условий, при которых доступ к услуге или информации будет либо заблокирован, либо возможен за время, которое не обеспечит выполнение тех или иных целей;", "11.\tМодель нарушителя информационной безопасности это:": "*документ, содержащий описание и классификацию нарушителей информационной безопасности, их опыта, знаний, доступных ресурсов, необходимых для реализации угрозы, возможной мотивации их действий, а также способы реализации угроз со стороны таких нарушителей;", "12.\t При разработки модели нарушителя нужно учитывать:": "*категории лиц, к которым можно отнести нарушителя; цели, градации по степени опасности и важности; анализ технической мощности нарушителя; предположения и ограничения о характере действий;", "13.\tКомпьютерная система критических технологий может быть представлена в виде следующих основных функциональных подсистем (исключить лишнее):": "* подсистема выработки команд синхронизации (подсистема тактирования внутренних функциональных процессов).", "14.\t Идентификация и аутентификация пользователей используется при проверке подлинности и осуществлении контроля доступа субъектов :": "*к монитору;", "15.\tШифрование информации обеспечивает:": "*авторизацию пользователя.", "16.\tРегистрация и учет используется для контроля:": "*сеансов связи недоверенных абонентов;", "17.\tПод защищенной системой обработки информации понимается система, которая обладает следующими свойствами (исключить лишнее):": "*обеспечивает отказоустойчивость к программным ошибкам.", "18.\tИнтегральный количественный показатель защищенности в информационной системе определяется в виде": "*R — показатель эффективности применения конструктивно заложенных в СЗИ средств защиты на интервале [0, Т]", "19.\tКакое свойство поглощает другое:": "*Свойство защищенность входит составной частью в более сложное свойство информационной системы - безопасность информации.", "20.\tРезультат воздействия информационного оружия может привести к (что лишнее?):": "*5. Потере прав интеллектуальной собственности на информационные ресурсы.", "21.\tКомплекс мер по защите программного обеспечения ИТКС от информационного оружия включает (исключить лишнее):": "*7. Разработка защищенных волоконно-оптических линий передачи информации.", "22.\tБезопасность информации, применительно к техническим системам отражает следующие аспекты качества обрабатываемой, передаваемой и хранимой информации в АСУ (допишите позицию, которой не хватает):": "…………………….*надежность программных средств,", "23.\tСтратегии защиты информации подразделяются на (дописать необходимое):": "…………………*упреждающие", "24.\tВ ИТКС должны обеспечиваться следующие функции безопасности информации (какая позиция лишняя):": "*надежность и устойчивость каналов связи;", "25.\tФормальная политика безопасности это:": "*интегральная совокупность норм и правил, регламентирующих процесс обработки информации, выполнение которых обеспечивает состояние защищенности информации в заданном пространстве угроз", "26.\t МОДЕЛЬ OSI/ISO включает следующие уровни (лишний исключить):": "*системный уровень", "27.\tМодель решетки ценностей.": "*3) антисимметричность: А<В, В<А => А=В.", "28.\tОпределение. (SC, <) называется решеткой, если для любых А, BSC существует (дописать) * ABSC и ABSC.": "28.\tОпределение. (SC, <) называется решеткой, если для любых А, BSC существует (дописать) * ABSC и ABSC.", "29.\tЛемма. Для любого набора S={А1,...,Аn} элементов из решетки SC существуют единственные элементы (дописать):": "*S=A1...An - наибольшая нижняя граница S.", "30.\tMLS Решетка строится как прямое произведение линейной решетки L и решетки SC подмножеств множества X, т.е. (,), (’,’) -элементы произведения, ,’L - линейная решетка,  ,’SC - решетка подмножеств некоторого множества X.": "\t* min{,’}).", "31.\tПод субъектом (S) понимается:": "*активная сущность компьютерной системы, которая может изменять состояние системы через порождение процессов над объектами, в том числе, порождать новые объекты и инициализировать порождение новых субъектов", "32.\t Под объектом (О) понимается:": "*пассивная сущность компьютерной системы, процессы над которой могут в определенных случаях быть источником порождения новых субъектов", "33.\t Обозначение «Create (sj, oi) -> sm» описывает процесс:": "*из объекта oi порожден субъект sm при активизирующем воздействии субъекта sj", "34.\t Под потоком информации между объектом oi и объектом oj подразумевается:": "*произвольная операция над объектом oj, реализуемая в субъекте sm и зависящая от объекта oi", "35.\t Обозначение «Stream (sm, oi) -> oj» описывает процесс:": "*поток информации от объекта oi(oj) к объекту oj(oi) через субъект sm", "36.\t Функционально-ассоциированные объекты:": "*влияют непосредственно на сами процессы субъекта", "37.\t Ассоциированные объекты-данные:": "*выступают в роли аргументов в операциях, порождающих потоки информации", "38.\t В защищенной компьютерной системе в любой момент времени любой субъект и объект должны быть:": "*идентифицированы и аутентифицированы", "39.\t Монитор безопасности это:": "*активная компонента с соответствующим объектом-источником, который осуществляет управление доступом и контроль доступа субъектов к объектам", "40.\t К требованиям, предъявляемым к монитору безопасности относят:": "*полнота, изолированность, верифицируемость, непрерывность", "41.\t Существует формальная политика безопасности:": "*все варианты верны", "42.\t Модель Харрисона-Руззо-Ульмана является:": "*дискреционной моделью", "43.\t Какая из операций не относится к модели Харрисона-Руззо-Ульмана:": "*remove", "44.\t Критерий безопасности модели Харрисона-Руззо-Ульмана формулируется следующим образом:": "*для заданной системы начальное состояние Qo = (So,Oo,Mo) является безопасным относительно права r, если не существует применимой к Qo последовательности команд, в результате которой право r будет занесено в ячейку матрицы М, в которой оно отсутствовало в состоянии Q0.", "45.\t Какие команды применяются в модели “Take-Grant”": "*take, grand, create, remove", "46.\t Модель Take-Grant является:": "*дискреционной моделью", "47.\t Основные правила, гарантирующие безопасность в моделях разграничения доступа на основе мандатной политики:": "*No Read Up, No Write Down", "48.\t Работник не имеет права знакомиться с документом, гриф секретности которого выше его степени доступа:": "*NRU", "49.\t Работник не имеет права вносить информацию своего уровня безопасности в документ с более низким уровнем безопасности": "*NWD", "50.\t Модель Белла-ЛаПадулы является:": "*мандатной моделью", "51.\t Критерий безопасности в модели Белла-ЛаПадулы:": "*система безопасна тогда и только тогда, когда ее начальное состояние безопасно и все состояния, достижимые из неё путем применения конечной последовательности запросов, безопасны", "52.\t Если различным группам пользователей с различным уровнем доступа требуется доступ к одной и той же информации, какое из указанных ниже действий следует предпринять руководству?": "*улучшить контроль за безопасностью этой информации", "53.\t ФЗ 149 от 27.07.2006:": "*Об информации, информационных технологиях и о защите информации", "54.\tФЗ 390 от 28.12.2010:": "*О безопасности", "55.\t Закон РФ от 21.07.1993 N 5485-1 (ред. от 08.03.2015):": "*О государственной тайне", "56.\t К сведениям, составляющим государственную тайну относят:": "*все перечисленные варианты", "57.\t К органам защиты государственной тайны относятся:": "*все перечисленные варианты", "58.\t Классически считалось, что обеспечение безопасности информации складывается из трех составляющих:": "*Конфиденциальности, Целостности, Доступности", "59.\t Точками приложения процесса защиты информации к информационной системе являются:": "*аппаратное обеспечение, программное обеспечение и обеспечение связи", "60.\t К процедурам (механизмы) защиты относят:": "*все варианты верны", "61.\t Информационным потоком от объекта O (источник) к объекту O′ (приёмник) называется:": "*преобразование информации в объекте O′, зависящее от информации в объекте O", "62.\t Ценность информации это:": "*количественная характеристика информации, определяющая ее прагматическую сторону, значение информации для получателя", "63.\tДискреционная политика безопасности:": "*политика безопасности, осуществляемая на основании заданного администратором множества разрешенных отношений доступа", "64.\t Мандатная политика безопасности": "*политика безопасности, основанная на совокупности предоставления доступа, определенного на множестве атрибутов безопасности субъекта и объекта", "65.\t К достоинствам дискреционной политики безопасности можно отнести:": "*относительно простую реализацию соответствующих механизмов защиты", "66.\t К достоинствам мандатной политики безопасности можно отнести:": "*высокая степень надежности", "67.\t Основу мандатной политики безопасности составляет мандатное управление доступом (Mandatory Access Control - MAC), которое подразумевает, что:": "*все перечисленные варианты", "68.\t Основой дискреционной (дискретной) политики безопасности является дискреционное управление доступом (Discretionary Access Control -DAC), которое определяется двумя свойствами:": "*все субъекты и объекты должны быть идентифицированы, права доступа субъекта к объекту системы определяются на основании некоторого внешнего по отношению к системе правила (заранее не закладывается в систему)", "69.\t В качестве классификационного признака для систем защиты можно выбрать их функциональные свойства. На основе этого признака выделяются системы:": "*без схем защиты, с полной защитой, с единой схемой защиты, с программируемой схемой защиты, системы с засекречиванием, комплексные системы защиты", "70.\t Модель МакЛина является:": "*мандатной моделью", "71.\t Согласно модели МакЛина основная теорема безопасности основывается на:": "*понятии безопасного перехода", "72.\t Согласно модели МакЛина функция перехода является безопасной тогда и только тогда, когда:": "*она является безопасной и по чтению, и по записи", "73.\t К недостаткам теоремы безопасности Белла-ЛаПадулы можно отнести:": "*все варианты верны", "74.\t Основная задача вероятностных моделей:": "*минимизация вероятности преодоления системы защиты", "75.\t Что из указанных вариантов характеризует модель системы безопасности с полным перекрытием?": "*система, использующая данную модель, должна иметь, по крайней мере, одно средство для обеспечения безопасности на каждом возможном пути проникновения в систему", "76.\t Система считается невыводимо безопасной, если:": "*пользователи с низким уровнем безопасности не могут получить информацию с высоким уровнем безопасности в результате любых действий пользователей с высоким уровнем безопасности", "77.\t Модель Биба относится к:": "*модели контроля целостности", "78.\t Основные правила, в мандатной модели целостности Биба": "*No Read Down, No Write Up", "79.\t Система – это:": "*совокупность связанных между собой и с внешней средой элементов или частей, функционирование которых направлено на получение конкретного полезного результата", "80.\t Канал связи:": "*это совокупность технических устройств, обеспечивающих передачу сигнала от источника к получателю", "81.\t Информация:": "*это сведения (сообщения, данные) независимо от формы их представления»", "82.\t Защита информации:": "*представляет собой принятие правовых, организационных и технических мер, направленных на: обеспечение защиты информации от неправомерного доступа, уничтожения, модифицирования, блокирования, копирования, предоставления, распространения, а также от иных неправомерных действий в отношении такой информации; соблюдение конфиденциальности информации ограниченного доступа; реализацию права на доступ к информации", "83.\t К видам защищаемой информации не относится:": "*сведения о чрезвычайных происшествиях и катастрофах, угрожающих безопасности и здоровью граждан, о состоянии экологии, о привилегиях, компенсациях и социальных гарантиях, предоставляемых государством гражданам", "84.\t К основным объектам информационной безопасности относятся:": "*компьютерные системы, базы данных", "85.\t Информация в зависимости от категории доступа к ней подразделяется на:": "*общедоступную информацию и информацию ограниченного доступа", "86.\t К угрозам национальной безопасности России в информационной сфере относится:": "*нарушение сохранности информационных ресурсов, получение несанкционированного доступа к ним", "87.\t Как называются компьютерные системы, в которых обеспечивается безопасность информации?:": "*защищенные КС", "88.\t Как называется процедура аутентификации, в которой участвуют только две стороны, устанавливающие подлинность друг друга:": "*процедура непосредственной аутентификацией", "89.\t Непосредственная причина возникновения угрозы называется:": "*источник угрозы", "90.\t На какую группу могут быть классифицированы угрозы информационной безопасности по местонахождению?:": "*внутренние и внешние", "91.\t Величина угрозы для элемента информации определяется как:": "*произведение ущерба от реализации угрозы и вероятности ее реализации", "92.\tКлассификация скрытых каналов в ГОСТ Р 53113.1-2008 производится по разным критериям, выделяются:": "*скрытые зашумленные каналы", "93.\t Если злоумышленник внедрил в компьютер вредоносную программу и получил доступ к личной информации пользователя, какая угроза была реализована?:": "*угроза конфиденциальности", "94.\t Анна послала письмо Степану. Злоумышленник уничтожил письмо Анны, подсунул свое и отправил Степану от имени Анны. Какая угроза была реализована?:": "*угроза целостности", "95.\t Если в результате DDOS-атаки новостной сайт на какое-то время вышел из строя и был недоступен для пользователей, какая угроза была реализована?:": "*угроза доступности", "96.\tМодель, основанная на принципе невмешательства, разработана для:": " *разрешения проблемы скрытых каналов утечки информации;", "97.\tВ модели, основанной на принципе невмешательства,  система является безопасной, если:": "*группы субъектов не вмешиваются в работу друг друга;", "98.\tСистема в модели, основанной на принципе невмешательства,  представлена как машина состояний, описанная следующим образом:": "*Множество команд изменения состояний можно записать (выпишите формулу для С) как С = S × Z на основании того, что уровень секретности субъекта оказывает влияние на выполняемую команду.", "99.\t Модель  невыводимости базируются на описании:": " *инфор¬мационных потоков в системе;", "100.\tФормальное определение модели невыводимости.": "Под системой в модели невыво¬димости понимается четверка (Е, I, О, T), где Е — множество событий, IЕ — мно¬жество событий ввода, ОЕ- множество событий вывода, Т — множество всех возможных конечных последовательностей событий. Множество Е разделяется на мно¬жество высокоуровневых (H) и низкоуровневых (L) событий (Е = HL, HL = ). Тогда можно определить (допишите необходимое) высокоуровневый ввод Highj = НL, высокоуровневый вывод High0 = НО, низкоуровневый ввод *Lowl = L I, низкоуровневый вывод *Low0 =LО.", "К внешним угрозам ИБ относят:": "*несанкционированный доступ к информации со стороны заинтересованных организаций и отдельных лица, компьютерные вирусы и иные вредоносные программы, стихийные бедствия и техногенные катастрофы", "Угрозы конфиденциальности:": "*заключается в том, что информация становится известной тому, кто не располагает полномочиями доступа к ней", "Информационные процессы:": "*это процессы, связанные с поиском, хранением, передачей, обработкой и использованием информации", "Хранение информации:": "*это способ распространения информации в пространстве и времени", "Система – это:": "*совокупность связанных между собой и с внешней средой элементов или частей, функционирование которых направлено на получение конкретного полезного результата", "Канал связи:": "*это совокупность технических устройств, обеспечивающих передачу сигнала от источника к получателю", "Информация в зависимости от категории доступа к ней подразделяется на:": "*общедоступную информацию и информацию ограниченного доступа", "Под национальной безопасностью РФ понимается:": "*безопасность ее многонационального народа как носителя суверенитета и единственного источника власти в РФ", "Доступность – это:": "*возможность за приемлемое время получить требуемую информационную услугу", "Целостность информации – это:": "*её состояние, при котором отсутствует любое ее изменение либо изменение осуществляется только преднамеренно субъектами, имеющими на него право", "«Троянская программа» – это:": "*вредоносная программа, проникающая в компьютер под видом легального программного обеспечения для хищения информации и разрушения программного обеспечения", "Что такое политика безопасности организации:": "*одно или несколько правил, процедур, практических приемов или руководящих принципов в области безопасности, которыми руководствуется организация в своей деятельности", "Что понимается под аббревиатурой «НСД»?:": "*несанкционированный доступ", "Наиболее распространенной угрозой информационной безопасности корпоративной системы является:": "*ошибки эксплуатации и неумышленного изменения режима работы системы покупка нелицензионного ПО", "К основным объектам информационной безопасности относятся:": "*компьютерные системы, базы данных", "Сбой системы – это:": "*нарушение работоспособности какого-либо элемента системы в следствии чего функции выполняются неправильно в заданный момент", "К принципу политики информационной безопасности относится:": "*принцип разделения доступа (обязанностей, привилегий) к сети (системы)", "Защищаемая информация:": "*это любая документированная информация, неправомерное обращение с которой может нанести ущерб ее собственнику, владельцу, пользователю или иному лицу»", "Автоматизированная система:": "*это система, состоящая из персонала и комплекса средств автоматизации его деятельности, реализующая информационную технологию выполнения установленных функций", "К угрозам национальной безопасности России в информационной сфере относится:": "*нарушение сохранности информационных ресурсов, получение несанкционированного доступа к ним", "Проверка подлинности (соответствия) пользователя по предъявленному им идентификатору называется:": "*аутентификация", "Определение тождественности пользователя или пользовательского процесса, необходимое для управления доступом это:": "*идентификация", "Несанкционированное копирование программ и данных является:": "*преднамеренной угрозой конфиденциальности; информации", "Системы идентификации и аутентификации пользователей относятся к:": "*аппаратно-программным средствам защиты информации", "Основными рисками информационной безопасности являются:": "*потеря, искажение, утечка информации", "Таргетированная атака – это:": "*атака на компьютерную систему крупного предприятия", "Нелегальное внедрение и использование неучтенных программ (игровых, обучающих, технологических и др., не являющихся необходимыми для выполнения нарушителем своих служебных обязанностей) с последующим необоснованным расходованием ресурсов (загрузка процессора, захват оперативной памяти и памяти на внешних носителях) относится к:": "*преднамеренным искусственным угрозам"}